CREATE DATABASE IF NOT EXISTS test;

CREATE TABLE IF NOT EXISTS test.phrases_views (
    dt DateTime,
    campaign_id Int32 comment 'Идентификатор рекламной кампании',
    phrase String comment 'Поисковой запрос',
    views Int32 comment 'Кумулятивное (суммарное) количество просмотров по поисковому запросу за всё время'
) engine = ReplacingMergeTree
ORDER BY
    (dt, campaign_id, phrase);

INSERT INTO
    test.phrases_views (dt, campaign_id, phrase, views)
VALUES
    ('2026-02-16 11:50:00', 1111111, 'платье', 0),
    ('2026-02-16 12:00:00', 1111111, 'платье', 1),
    ('2026-02-16 12:10:00', 1111111, 'платье', 1),
    ('2026-02-16 12:20:00', 1111111, 'платье', 1),
    ('2026-02-16 12:30:00', 1111111, 'платье', 1),
    ('2026-02-16 12:40:00', 1111111, 'платье', 1),
    ('2026-02-16 12:50:00', 1111111, 'платье', 1),
    ('2026-02-16 13:00:00', 1111111, 'платье', 1),
    ('2026-02-16 13:10:00', 1111111, 'платье', 1),
    ('2026-02-16 13:20:00', 1111111, 'платье', 1),
    ('2026-02-16 13:30:00', 1111111, 'платье', 2),
    ('2026-02-16 13:40:00', 1111111, 'платье', 3),
    ('2026-02-16 13:50:00', 1111111, 'платье', 5),
    ('2026-02-16 14:00:00', 1111111, 'платье', 5),
    ('2026-02-16 14:10:00', 1111111, 'платье', 6),
    ('2026-02-16 14:20:00', 1111111, 'платье', 8),
    ('2026-02-16 14:30:00', 1111111, 'платье', 9),
    ('2026-02-16 14:40:00', 1111111, 'платье', 10),
    ('2026-02-16 14:50:00', 1111111, 'платье', 11),
    ('2026-02-16 15:00:00', 1111111, 'платье', 11),
    ('2026-02-16 15:10:00', 1111111, 'платье', 11),
    ('2026-02-16 15:20:00', 1111111, 'платье', 12),
    ('2026-02-16 15:30:00', 1111111, 'платье', 13),
    ('2026-02-16 15:40:00', 1111111, 'платье', 13),
    ('2026-02-16 15:50:00', 1111111, 'платье', 15),
    ('2026-02-16 16:00:00', 1111111, 'платье', 15);